## `mintak`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖[32m[1mSuccess![0m The configuration is valid.
[0m

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # google_billing_budget.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_billing_budget" "this" {
      [32m+[0m [0m[1m[0mbilling_account[0m[0m = "01ED0E-0EF6B9-F55E96"
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m    = "GCP Budget Alert"
      [32m+[0m [0m[1m[0mid[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m            = (known after apply)

      [32m+[0m [0mamount {
          [32m+[0m [0mspecified_amount {
              [32m+[0m [0m[1m[0mcurrency_code[0m[0m = "JPY"
              [32m+[0m [0m[1m[0munits[0m[0m         = "3000"
            }
        }

      [32m+[0m [0mbudget_filter {
          [32m+[0m [0m[1m[0mcredit_types[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mcredit_types_treatment[0m[0m = "INCLUDE_ALL_CREDITS"
          [32m+[0m [0m[1m[0mlabels[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mservices[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0msubaccounts[0m[0m            = (known after apply)
        }

      [32m+[0m [0mthreshold_rules {
          [32m+[0m [0m[1m[0mspend_basis[0m[0m       = "CURRENT_SPEND"
          [32m+[0m [0m[1m[0mthreshold_percent[0m[0m = 0.5
        }
      [32m+[0m [0mthreshold_rules {
          [32m+[0m [0m[1m[0mspend_basis[0m[0m       = "FORECASTED_SPEND"
          [32m+[0m [0m[1m[0mthreshold_percent[0m[0m = 0.85
        }
      [32m+[0m [0mthreshold_rules {
          [32m+[0m [0m[1m[0mspend_basis[0m[0m       = "CURRENT_SPEND"
          [32m+[0m [0m[1m[0mthreshold_percent[0m[0m = 1
        }
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @mintak21, Action: `pull_request`, Workflow: `Terraform Continuous Integration`*